MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1906/mcu.h
extern volatile SPBRGbits_t SPBRGbits __at(0x19B);
// bitfield macros
#define _SPBRG_SPBRGL_POSN                                  0x0
#define _SPBRG_SPBRGL_POSITION                              0x0
#define _SPBRG_SPBRGL_SIZE                                  0x8
#define _SPBRG_SPBRGL_LENGTH                                0x8
#define _SPBRG_SPBRGL_MASK                                  0xFF
#define _SPBRG_BRG0_POSN                                    0x0
#define _SPBRG_BRG0_POSITION                                0x0
#define _SPBRG_BRG0_SIZE                                    0x1
#define _SPBRG_BRG0_LENGTH                                  0x1
#define _SPBRG_BRG0_MASK                                    0x1
#define _SPBRG_BRG1_POSN                                    0x1
#define _SPBRG_BRG1_POSITION                                0x1
#define _SPBRG_BRG1_SIZE                                    0x1
#define _SPBRG_BRG1_LENGTH                                  0x1
#define _SPBRG_BRG1_MASK                                    0x2
#define _SPBRG_BRG2_POSN                                    0x2
#define _SPBRG_BRG2_POSITION                                0x2
#define _SPBRG_BRG2_SIZE                                    0x1
#define _SPBRG_BRG2_LENGTH                                  0x1
#define _SPBRG_BRG2_MASK                                    0x4
#define _SPBRG_BRG3_POSN                                    0x3
#define _SPBRG_BRG3_POSITION                                0x3
#define _SPBRG_BRG3_SIZE                                    0x1
#define _SPBRG_BRG3_LENGTH                                  0x1
#define _SPBRG_BRG3_MASK                                    0x8
#define _SPBRG_BRG4_POSN                                    0x4
#define _SPBRG_BRG4_POSITION                                0x4
#define _SPBRG_BRG4_SIZE                                    0x1
#define _SPBRG_BRG4_LENGTH                                  0x1
#define _SPBRG_BRG4_MASK                                    0x10
#define _SPBRG_BRG5_POSN                                    0x5
#define _SPBRG_BRG5_POSITION                                0x5
#define _SPBRG_BRG5_SIZE                                    0x1
#define _SPBRG_BRG5_LENGTH                                  0x1
#define _SPBRG_BRG5_MASK                                    0x20
#define _SPBRG_BRG6_POSN                                    0x6
#define _SPBRG_BRG6_POSITION                                0x6
#define _SPBRG_BRG6_SIZE                                    0x1
#define _SPBRG_BRG6_LENGTH                                  0x1
#define _SPBRG_BRG6_MASK                                    0x40
#define _SPBRG_BRG7_POSN                                    0x7
#define _SPBRG_BRG7_POSITION                                0x7
#define _SPBRG_BRG7_SIZE                                    0x1
#define _SPBRG_BRG7_LENGTH                                  0x1
#define _SPBRG_BRG7_MASK                                    0x80
typedef union {
    struct {
        unsigned SPBRGL                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRGL1bits_t;
extern volatile SPBRGL1bits_t SPBRGL1bits __at(0x19B);
// bitfield macros
#define _SPBRGL1_SPBRGL_POSN                                0x0
#define _SPBRGL1_SPBRGL_POSITION                            0x0
#define _SPBRGL1_SPBRGL_SIZE                                0x8
#define _SPBRGL1_SPBRGL_LENGTH                              0x8
#define _SPBRGL1_SPBRGL_MASK                                0xFF
#define _SPBRGL1_BRG0_POSN                                  0x0
#define _SPBRGL1_BRG0_POSITION                              0x0
#define _SPBRGL1_BRG0_SIZE                                  0x1
#define _SPBRGL1_BRG0_LENGTH                                0x1
#define _SPBRGL1_BRG0_MASK                                  0x1
#define _SPBRGL1_BRG1_POSN                                  0x1
#define _SPBRGL1_BRG1_POSITION                              0x1
#define _SPBRGL1_BRG1_SIZE                                  0x1
#define _SPBRGL1_BRG1_LENGTH                                0x1
#define _SPBRGL1_BRG1_MASK                                  0x2
#define _SPBRGL1_BRG2_POSN                                  0x2
#define _SPBRGL1_BRG2_POSITION                              0x2
#define _SPBRGL1_BRG2_SIZE                                  0x1
#define _SPBRGL1_BRG2_LENGTH                                0x1
#define _SPBRGL1_BRG2_MASK                                  0x4
#define _SPBRGL1_BRG3_POSN                                  0x3
#define _SPBRGL1_BRG3_POSITION                              0x3
#define _SPBRGL1_BRG3_SIZE                                  0x1
#define _SPBRGL1_BRG3_LENGTH                                0x1
#define _SPBRGL1_BRG3_MASK                                  0x8
#define _SPBRGL1_BRG4_POSN                                  0x4
#define _SPBRGL1_BRG4_POSITION                              0x4
#define _SPBRGL1_BRG4_SIZE                                  0x1
#define _SPBRGL1_BRG4_LENGTH                                0x1
#define _SPBRGL1_BRG4_MASK                                  0x10
#define _SPBRGL1_BRG5_POSN                                  0x5
#define _SPBRGL1_BRG5_POSITION                              0x5
#define _SPBRGL1_BRG5_SIZE                                  0x1
#define _SPBRGL1_BRG5_LENGTH                                0x1
#define _SPBRGL1_BRG5_MASK                                  0x20
#define _SPBRGL1_BRG6_POSN                                  0x6
#define _SPBRGL1_BRG6_POSITION                              0x6
#define _SPBRGL1_BRG6_SIZE                                  0x1
#define _SPBRGL1_BRG6_LENGTH                                0x1
#define _SPBRGL1_BRG6_MASK                                  0x40
#define _SPBRGL1_BRG7_POSN                                  0x7
#define _SPBRGL1_BRG7_POSITION                              0x7
#define _SPBRGL1_BRG7_SIZE                                  0x1
#define _SPBRGL1_BRG7_LENGTH                                0x1
#define _SPBRGL1_BRG7_MASK                                  0x80
typedef union {
    struct {
        unsigned SPBRGL                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRGLbits_t;
